ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
// Copyright (c) 2023 Ziga Miklosic
// All Rights Reserved
////////////////////////////////////////////////////////////////////////////////
/**
*@file      ble_p.c
*@brief     Bluetooth Peripheral drivers
*@author    Ziga Miklosic
*@date      10.01.2023
*@version   V1.0.0
*
*
*@description
*
*   This code contains simple on BLE peripheral device connection with
*   two characteristics. Both for advertisement and connection LE UNCODED
*   1M PHY is used.
*
*   After connection is established advertising is automatically stopped.
*   After connection is lost advertising is automatically stared.
*
*
*@note      This file shall be in following directory:
*           
*               /drivers/peripheral/ble
*/
////////////////////////////////////////////////////////////////////////////////
/*!
* @addtogroup BLE_P
* @{ <!-- BEGIN GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Includes
////////////////////////////////////////////////////////////////////////////////
#include <stdint.h>
#include <stdlib.h>
#include <assert.h>
#include "project_config.h"

#include "ble_p.h"
#include "middleware/ring_buffer/src/ring_buffer.h"




#include "app_timer.h"

// For softdevice
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

// BLE queue manager to stack
#include "nrf_ble_qwr.h"

// GATT
#include "nrf_ble_gatt.h"

// For advertisement
#include "ble_advertising.h"
 
 // For connection parameters
#include "ble_conn_params.h"


// TODO: Remove LED FOR DEBUG
#include "drivers/hmi/led/led/src/led.h"




// Debug COM port
#include "middleware/cli/cli/src/cli.h"


////////////////////////////////////////////////////////////////////////////////
// Definitions
////////////////////////////////////////////////////////////////////////////////

/**
 *      BLE Peripheral data
 */
typedef struct
{
    uint16_t    conn_handle;        /**<Connection Handle on which event occurred */
    bool        is_adv;             /**<Advertisment active flag */ 

} ble_p_data_t;

/**
 *      BLE Peripheral connection tag
 *
 * @brief   Connection config tag is a unique key for keeping track of an 
 *          advertising configuration
 *
 *          Further details: https://devzone.nordicsemi.com/f/nordic-q-a/33504/what-does-app_ble_conn_cfg_tag-do 
 */ 
#define BLE_P_CONN_CFG_TAG                  ( 1 )


/**
 *      Main BLE Peripheral event priority
 */
#define BLE_P_EVENT_PRIORITY                3

/**
 *		BLE Peripheral reception buffer size
 *
 *	Unit: byte
 */                     
#define BLE_P_RX_BUF_SIZE                   ( 512 )  

/**
 *      Device name
 */
#define BLE_P_DEVICE_NAME                   ( "MyBLE" )

/**
 *      Device BLE appearance
 *
 * @note    Shall have standard value!
 *
 *          Look at "ble_types.h" file for pre-defined values.
 */
#define BLE_P_DEVICE_APPEARANCE             ( BLE_APPEARANCE_GENERIC_COMPUTER )

/**
 *      Minimum connection interval
 *
 * @brief   This is part of Peripheral Prefered Connection Parameter (PPCP)
 *          values. It only suggest Central BLE device about connection
 *          timing. At the end Central BLE device is deciding if 
 *          respect these values or ignore them.
 *
 *          Valid value range: 7.5 ms - 4.0 sec
 *          Resolution:  1.25 ms
 *
 * @note    Min. connection interval shall not be larger than max.!
 *
 *  Unit: ms
 */
#define BLE_P_MIN_CONN_INTERVAL_MS          ( 100 ) 

/**
 *      Maximum connection interval
 *
 * @brief   This is part of Peripheral Prefered Connection Parameter (PPCP)
 *          values. It only suggest Central BLE device about connection
 *          timing. At the end Central BLE device is deciding if 
 *          respect these values or ignore them.
 *
 *          Valid value range: 7.5 ms - 4.0 sec
 *          Resolution:  1.25 ms
 *
 * @note    Min. connection interval shall not be larger than max.!
 *
 *  Unit: ms
 */
#define BLE_P_MAX_CONN_INTERVAL_MS          ( 200 ) 

/**
 *      Slave latency
 *
 * @brief   This is part of Peripheral Prefered Connection Parameter (PPCP)
 *          values. Slave latency parameter allows the peripheral to skip a number
 *          of consecutive connection Events without compromising the
 *          connection.
 *
 *          The slave latency value defines the number of connection
 *          events it can safely skip.
 *
 *          Valid value range: 0 - ((connSupervisionTimeout / connIntervalMax) - 1)
 *
 * @note    Value of 0 means that Peripheral BLE device needs to address
 *          every connection event triggered by Central BLE device.
 */
#define BLE_P_SLAVE_LATENCY                 ( 0 )

/**
 *      Supervsision timeout
 *
 * @brief   This is part of Peripheral Prefered Connection Parameter (PPCP)
 *          values. The Supervision Timeout is used to detect a loss in 
 *          communication. It is defined as maximum time between two received 
 *          data packets before the connection is considered lost.
 *
 *          Valid value range: 100 ms - 32 sec
 *
 * @note    Additional condition to check:
 *
 *              SupervisionTimeout > (( 1 + SlaveLatency ) * connInterval * 2 )
 *
 *  Unit: ms
 */
#define BLE_P_SUPERVISION_TIMEOUT_MS        ( 4000 )

 /**
  *     Advertisement inteval
  * 
  * @brief  Advertisement interval dictates time between two consequtive
  *         advertisement packets.
  *
  *         Valid value range: 20 ms - 10.24 sec
  *         Resolution: 0.625 ms
  *
  * @note   The advertising interval greatly impacts battery life. It is 
  *         recommended to choose the longest advertising interval that provides
  *         a balance between fast connectivity and reduced power consumption!
  *
  *     Unit: ms
  */
#define BLE_P_ADV_INTERVAL_MS                 ( 200.0 )

/**
 *      Advertisement duration
 *
 * @brief   Advertisement duration defines how long BLE peripheral
 *          device will advertise. After that time advertismeent
 *          will stop and Central BLE device won't be able to 
 *          scan it.
 *
 * @note    Value = 0 --> Continous advertisement!  
 *   
 *  Unit: ms
 */
#define BLE_P_ADV_DURATION_MS                   ( 15000 )

/**
 *      Enable/Disable start of addvertisement on disconnection event
 */
#define BLE_P_START_ADV_ON_DISCONNECT           ( 1 )

/**
 *      Company ID
 *
 * @brief   Company ID is part of Manufacturer Specific Data 
 *          in advertisement packet.
 *          
 *          Company ID values is defined by SIG BLE.
 *          
 *          Further details: https://btprodspecificationrefs.blob.core.windows.net/assigned-numbers/Assigned%20Number%20Types/Assigned%20Numbers.pdf
 *
 * @note    Company ID = 0x0059 for Nordic Semiconductor ASA
 */
#define BLE_P_ADV_MAN_DATA_COMPANY_ID           ( 0x0059 )


/**
 * 	Enable/Disable debug mode
 *
 * 	@note	Disable in release!
 */
#define BLE_P_DEBUG_EN						( 1 )

