ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    // Update PHY
    if ( NRF_SUCCESS != sd_ble_gap_phy_update( p_ble_evt->evt.gap_evt.conn_handle, &phys))
    {
        // TODO: How to handle this error???

        BLE_P_DBG_PRINT( "BLE_P: PHY update error!" );
        BLE_P_ASSERT( 0 );
    }
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE on missing system attributes event handler 
*
* @note     This function is being executed in main BLE stack callback!
*
* @param[in] 	p_ble_evt   - Pointer to BLE event informations
* @return 		void
*/
////////////////////////////////////////////////////////////////////////////////
static inline void ble_p_evt_on_missing_attr(ble_evt_t const * p_ble_evt)
{
    // Update persistent system attribute information
    if ( NRF_SUCCESS != sd_ble_gatts_sys_attr_set( g_ble_p.conn_handle, NULL, 0, 0))
    {
        // TODO: How to handle this error???

        BLE_P_DBG_PRINT( "BLE_P: Setting SYSTEM_ATTRIBUTES error!" );
        BLE_P_ASSERT( 0 );
    }    
}

////////////////////////////////////////////////////////////////////////////////
/**
*		Initialize BLE Peripheral GAP
*
* @return 		status - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t ble_p_gap_init(void)
{
    ble_p_status_t              status          = eBLE_P_OK;
    ble_gap_conn_params_t       gap_conn_params = {0};
    ble_gap_conn_sec_mode_t     security_mode   = {0};

    // Use no security
    BLE_GAP_CONN_SEC_MODE_SET_OPEN( &security_mode );

    // Set the device name
    if ( NRF_SUCCESS != sd_ble_gap_device_name_set( &security_mode, (const uint8_t*) BLE_P_DEVICE_NAME, strlen( BLE_P_DEVICE_NAME )))
    {
        status = eBLE_P_ERROR;

        BLE_P_DBG_PRINT( "BLE_P: Setting device name error (GAP)!" );
    }

    // Set the apperance
    if ( NRF_SUCCESS != sd_ble_gap_appearance_set( BLE_P_DEVICE_APPEARANCE ))  
    {
        status = eBLE_P_ERROR;

        BLE_P_DBG_PRINT( "BLE_P: Setting device appearance error (GAP)!" );
    }

    // Set up GAP
    gap_conn_params.min_conn_interval   = MSEC_TO_UNITS( BLE_P_MIN_CONN_INTERVAL_MS, UNIT_1_25_MS );
    gap_conn_params.max_conn_interval   = MSEC_TO_UNITS( BLE_P_MAX_CONN_INTERVAL_MS, UNIT_1_25_MS );
    gap_conn_params.slave_latency       = BLE_P_SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout    = MSEC_TO_UNITS( BLE_P_SUPERVISION_TIMEOUT_MS, UNIT_10_MS );

    // Set the PPCP - Peripheral Prefered Connection Parameters
    if ( NRF_SUCCESS != sd_ble_gap_ppcp_set( &gap_conn_params ))
    {
        status = eBLE_P_ERROR;

        BLE_P_DBG_PRINT( "BLE_P: Setting Peripheral Prefered Connection Parameters (PPCP) error (GAP)!" ); 
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		Initialize BLE Peripheral GATT
*
* @return 		status - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t ble_p_gatt_init(void)
{
    ble_p_status_t status = eBLE_P_OK;

    // Initialize GATT
    if ( NRF_SUCCESS != nrf_ble_gatt_init( &g_gatt_instance, NULL ))
    { 
        status = eBLE_P_ERROR;

        BLE_P_DBG_PRINT( "BLE_P: GATT init error!" );  
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		Initialize BLE Peripheral advertisement
*
* @return 		status - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t ble_p_adv_init(void)
{
    ble_p_status_t              status   = eBLE_P_OK;
    ble_advertising_init_t      adv_init = {0};
    ble_advdata_manuf_data_t    man_data = {0};

    // Set up advertising parameters
    adv_init.advdata.name_type              = BLE_ADVDATA_FULL_NAME;
    adv_init.advdata.include_appearance     = true;
    adv_init.advdata.flags                  = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    adv_init.config.ble_adv_fast_enabled    = true;
    adv_init.config.ble_adv_fast_interval   = (uint32_t) ( BLE_P_ADV_INTERVAL_MS / 0.625f );
    adv_init.config.ble_adv_fast_timeout    = (uint32_t) ( BLE_P_ADV_DURATION_MS / 10.0f );
    adv_init.evt_handler                    = ble_p_adv_evt_hndl;
    adv_init.advdata.p_manuf_specific_data  = &man_data;
    
    // TODO: Find out how to add here custom service UUID
    #if 0
        // Show also available services in advertisement packet
        adv_init.advdata.uuids_complete.p_uuids = (ble_uuid_t*) &m_adv_uuids;
        adv_init.advdata.uuids_complete.uuid_cnt = 2;
    #endif

    // Set up manufacturer data
    man_data.company_identifier = BLE_P_ADV_MAN_DATA_COMPANY_ID;
    man_data.data.p_data        = "Vendor Data";
    man_data.data.size          = strlen( man_data.data.p_data );

    // Init advertisement
    if ( NRF_SUCCESS != ble_advertising_init( &g_adv_instance, &adv_init ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" );
    }
    
    // Setup advertising config tag
    ble_advertising_conn_cfg_tag_set( &g_adv_instance, BLE_P_CONN_CFG_TAG );

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral Advertisement event handler
*
* @param[in]    ble_adv_evt     - Advertisement event
* @return 		void
*/
////////////////////////////////////////////////////////////////////////////////
static void ble_p_adv_evt_hndl(ble_adv_evt_t ble_adv_evt)
{
    // Based on advertisemnt event
    switch (ble_adv_evt)
    {
        /**
         *      Fast advertising mode has started
         */
        case BLE_ADV_EVT_FAST:

            // Set adv flag
            g_ble_p.is_adv = true;

            // Raise callback
            ble_p_evt_cb( eBLE_P_EVT_ADV_START );

            BLE_P_DBG_PRINT( "BLE_P: Advertisement started!" );

            break;
        
        /**
         *      Idle; no connectable advertising is ongoing
         */
        case BLE_ADV_EVT_IDLE:

            // Clear adv flag
            g_ble_p.is_adv = false;

            // Raise callback
            ble_p_evt_cb( eBLE_P_EVT_ADV_END );

            BLE_P_DBG_PRINT( "BLE_P: Advertisement stoped!" );

            break;

        default:
            // No actions...
            break;
    }
}




